drorgl/micropython_embedding/lib/micropython-1.19/ports/generic/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "embedded"
#define MICROPY_HW_MCU_NAME "embedded"
